{"pageProps":{"allPosts":[{"title":"Why cybersecurity specialists should focus on minimizing damage caused by hackers rather than stopping all of their attacks","date":"March 15, 2025","slug":"2025-03-15","author":{"name":"Christian Vasquez"},"coverImage":"","excerpt":"The industry is undergoing a much needed switch from focusing on trying to prevent all unauthorized access to company networks to minimizing impact when a breach does occur. Because some breaches, at least, are nearly impossible to stop."},{"title":"The Cyber Security Recruiter talks to Michael Hamilton, Founder and CISO, Critical Insight","date":"January 13, 2025","slug":"2025-1-13","author":{"name":"Christian Vasquez"},"coverImage":"","excerpt":"Michael Hamilton talks with Thomas Richard on The Cyber Security Recruiter Podcast"},{"title":"NICE Challenge Project (to be XP Cyber in 2025)","date":"November 12, 2024","slug":"2024-11-12","author":{"name":null},"coverImage":"","excerpt":"Our cybersecurity challenges are designed around and inspired by the most in-demand technical cyber work roles and the tasks those work roles must be able to competently perform to be successful."},{"title":"Try Cyber","date":"November 11, 2024","slug":"2024-11-11","author":{"name":null},"coverImage":"","excerpt":"Try Cyber is a web application for cyber work role discovery and exploration."},{"title":"PISCES Technical Advisory Chair publishes new analyst book","date":"October 15, 2024","slug":"2024-10-15","author":{"name":null},"coverImage":"","excerpt":"The architect of the PISCES cyber analyst curriculum Michael Tsikerdekis has published a new book on taking you from zero to hero to ultimately become a security analyst."},{"title":"Spokane Falls Cyber Center trains future workforce through industry partnership","date":"July 23, 2024","slug":"2024-07-23","author":{"name":"Kayla Friedrich"},"coverImage":"","excerpt":"Through a partnership between the cyber program and PISCES, students are gaining real work experience as cyber analysts."},{"title":"PISCES International partners with Intersect Insight LLC to support its international expansion","date":"April 22, 2024","slug":"2024-04-22","author":{"name":null},"coverImage":"/assets/posts/intersect-insight.png","excerpt":"Intersect Insight LLC, an international business development and enterprise viability consultancy, has partnered with PISCES International to expand its global presence."},{"title":"Dr. Tsikerdekis selected as a U.S. Fulbright Scholar","date":"March 6, 2024","slug":"2024-03-06","author":{"name":null},"coverImage":"","excerpt":"Associate Professor Michael Tsikerdekis will spend 6 months in Greece in 2025 to research implementing a version of PISCES"},{"title":"On The Cyber Front Line In Big Sky Country","date":"February 21, 2024","slug":"2024-02-21","author":{"name":null},"coverImage":"/assets/posts/umt-soc-1.jpg","excerpt":"University of Montana Students Discover Threat Inside Critical Infrastructure During Cybersecurity Training Program"},{"title":"Small town in West Virginia suffers cyberattack","date":"January 8, 2024","slug":"2024-01-08","author":{"name":null},"coverImage":"","excerpt":"A cyberattack on the municipality of Beckley, West Virginia, caused a security breach within the city’s computer network on Thursday."},{"title":"New Veeam vulnerability advisory notice","date":"November 10, 2023","slug":"2023-11-10","author":{"name":null},"coverImage":"","excerpt":"This advisory is for organizations that use Veeam ONE to monitor virtual infrastructure, backup infrastructure, and data protection environments.  If your organization does not use this platform, this notification may be discarded. "},{"title":"Cyber students help protect civic institutions vulnerable to hackers","date":"September 12, 2023","slug":"2023-09-12","author":{"name":null},"coverImage":"","excerpt":"MSU Denver’s PISCES program provides cybersecurity monitoring for organizations throughout Colorado and gives students real-world experience in the process."},{"title":"CyberSensei Podcast hosts PISCES' Mike Hamilton","date":"March 29, 2023","slug":"2023-03-29","author":{"name":null},"coverImage":"","excerpt":"Mike Hamilton comes onto the CyberSensei podcast to discuss how to best prepare cybersecurity students for their jobs."},{"title":"FY23 PISCES Survey Results","date":"March 28, 2023","slug":"2023-03-28","author":{"name":null},"coverImage":"","excerpt":"In FY23 PISCES conducted a survey of all data sharing partners to better understand the community, students and assist in the planning process for the next cohort."},{"title":"Call for Papers for the 5th Annual PISCES Academic Workshop","date":"March 27, 2023","slug":"2023-03-27","author":{"name":null},"coverImage":"","excerpt":"The 5th Annual PISCES Academic Workshop will be held on 2 November 2023 in conjunction with the 27th CISSE at Kennesaw State University, Kennesaw, Georgia and on-line."},{"title":"Microsoft Urgent Outlook Vulnerability Notice","date":"March 17, 2023","slug":"2023-03-17","author":{"name":null},"coverImage":"","excerpt":"Microsoft has just released a patch to address a critical vulnerability in Microsoft Outlook for Windows"},{"title":"PISCES Partner Guides Students With Autism to Cybersecurity Careers","date":"February 16, 2023","slug":"2023-02-16","author":{"name":null},"coverImage":"","excerpt":"MSU Denver is working with neurodiverse cybersecurity students as part of PISCES."},{"title":"Training the Next Generation of Cyber Guardians","date":"November 2, 2022","slug":"2022-11-02","author":{"name":null},"coverImage":"","excerpt":"Executive director Steve Stein gives an overview of the program and some real cyber scenarios students have helped prevent."},{"title":"Eight Days Left to Apply for 2022 CyberForce Competition","date":"September 22, 2022","slug":"2022-09-22","author":{"name":null},"coverImage":"","excerpt":"The annual CyberForce Competition will be held as a hybrid competition this year on November 4-5, 2022. Registration is now open for the 2022 CyberForce Competition® for both student teams and volunteers. "},{"title":"An Intro To PISCES with Michael Hamilton and Steve Stein","date":"May 26, 2022","slug":"2022-05-26","author":{"name":null},"coverImage":"","excerpt":"Michael Hamilton and Steve Stein discuss the PISCES process and program operations."},{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"May 26, 2022","slug":"2022-06-07","author":{"name":null},"coverImage":"","excerpt":"Grace Dille of MeriTalk discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"2022-03-01","author":{"name":null},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"2022-01-19","author":{"name":null},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"2021-12-09","author":{"name":null},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"2021-12-02","author":{"name":null},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."},{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"2021-11-18","author":{"name":null},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"2021-11-13","author":{"name":null},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."}],"post":{"title":"Cyber students help protect civic institutions vulnerable to hackers","date":"September 12, 2023","slug":"2023-09-12","author":{"name":null},"content":"\n***(This article was originally published on [MSU Denver](https://red.msudenver.edu/2023/cyber-students-help-protect-civic-institutions-vulnerable-to-hackers/))***\n\n![Through the PISCES program, MSU Denver student Monica Ball helps protect civic institutions across Colorado from cyberattacks. Photo by Alyson McClaran](https://red.msudenver.edu/wp-content/uploads/2023/08/Cyber-Security-_0243_AM08172023_.jpg \"Through the PISCES program, MSU Denver student Monica Ball helps protect civic institutions across Colorado from cyberattacks. Photo by Alyson McClaran\")\n\n*Through the PISCES program, MSU Denver student Monica Ball helps protect civic institutions across Colorado from cyberattacks. Photo by Alyson McClaran*\n\nFor sophisticated hackers, small government agencies and local institutions can seem like sitting ducks. And while the federal government and major corporations all have generous budgets to fund monitoring and protection, most smaller organizations and civic institutions simply do not.\n\n“Colorado has many huge rural counties, way distant from cities, that have zero budget, expertise or practical means of providing protection from hackers,” said Richard Mac Namee, director of the Cybersecurity Center at Metropolitan State University of Denver.\n\nThat’s a big problem. Cybercrime accounts for a jaw-dropping amount of money — it’s predicted to reach a global cost of $8 trillion this year — and the threat is only growing. Fortunately, the PISCES (Public Infrastructure Security Cyber Education System) program at MSU Denver has found a  solution. The University’s Cybersecurity program supports 10 “customers,” including school districts, county governments and a fire department.\n\nThrough PISCES, student analysts provide a monitoring service, and when they spot anything suspicious, they escalate it immediately to the National Cybersecurity Center. The Colorado Springs-based nonprofit, which promotes cybersecurity innovation, education and workforce development, then passes on details of the security concern. Mac Namee says it’s fast, efficient and remarkably effective.\n\n“Smaller organizations desperately want help right now to protect their systems, while students training to be cyberanalysts absolutely need experience working with real data,” explained Mac Namee. “Put them together, and everyone wins.”\n\n![MSU Denver student Monica Ball and Cybersecurity Center Director Richard Mac Namee at work in MSU Denver’s Cyber Range. Photo by Alyson McClaran](https://red.msudenver.edu/wp-content/uploads/2023/08/Cyber-Security-_0027_AM08172023_.jpg \"MSU Denver student Monica Ball and Cybersecurity Center Director Richard Mac Namee at work in MSU Denver’s Cyber Range. Photo by Alyson McClaran\")\n\n### Expanding program\nProgram supporters say the beauty of PISCES, which originated in Washington state before coming to Colorado, lies in the simplicity of its central premise:  pairing organizations that lack any digital protection with Cybersecurity students who crave experience in a live working environment.\n\nAlthough successful, PISCES has operated at a modest level. Mac Namee sees the program’s potential to help many more organizations on a much broader scale.\n\n“The current risk level is the highest I’ve seen in five years,” Mac Namee said. “The introduction of AI, in particular, has meant even novice hackers can now weaponize advanced tech for serious attacks. We’re at a turning point, where immediate action is necessary.”\n\nOthers are recognizing the growing threat and the potential of PISCES to address it. Last month, the Colorado Attorney General’s Office awarded the program $500,000 to expand across the state over the next two years, with the potential for another $250,000 in 2025.\n\nAttorney General Phil Weiser said PISCES will create more jobs in the cybersecurity field and recruit participants from rural communities into this good-paying profession.\n\n“And all the while, it will be protecting Colorado residents from cybersecurity threats,” he said.\n\n### A proactive approach\nOne of the organizations benefiting from the students’ help is West Metro Fire Rescue. And the department’s IT director, Eric Bates, said the program has been a runaway success.\n\n“The vast amount of data generated by our systems had been posing a real challenge to us,” Bates said. “But fortunately, PISCES and MSU Denver came to our aid with a game-changing solution that has fundamentally improved our cybersecurity operations.”\n\nBates has been impressed by the students’ cutting-edge knowledge and fresh perspectives. But most of all, he is struck by their proactive approach to detecting and responding to potential security threats.\n\n“They have shown real skill and dedication in handling our difficult work and often uncover anomalies that our other threat-response services might miss,” he said.\n\n### Hands-on experience\nAmong the biggest winners from the program have been MSU Denver’s Cybersecurity students, whose overall learning experience has vaulted to a whole new level.\n\n“Working with the PISCES program means we get to apply all the concepts we learned in class within a realistic but guided setting and then refine them through continual practice,” said Monica Ball, a Cybersecurity student. “There’s nothing like getting hands-on experience of everything we’ve learned, such as analyzing workflow, contextualizing alerts and judging search parameters, then putting it all together under real-life circumstances. It’s a really cool way to hone your cyberanalysis skills.”\n\n![MSU Denver cybersecurity student Monica Ball. Photo by Alyson McClaran](https://red.msudenver.edu/wp-content/uploads/2023/08/Cyber-Security-_0258_AM08172023_.jpg \"MSU Denver cybersecurity student Monica Ball. Photo by Alyson McClaran\")\n\nCrucially, Ball added, the program also helps the students demonstrate to potential future employers that they’re made of the right stuff.\n\n“Most employers are looking for graduates with a degree and relevant experience in the field,” Ball said. “Working with PISCES not only boosts our confidence; it also gives us something tangible to discuss in interviews and makes us way more hireable.”\n\n#### Ready for action\nBy immersing students in real-world scenarios and setting them to work on reams of live data (and malicious threats), PISCES makes sure they’re primed to tackle challenges in the workplace.\n\nThat’s also why Mac Namee is looking to recruit more MSU Denver Cybersecurity students and graduates to join the PISCES program. He knows it’s a unique opportunity for them.\n\n“With cybersecurity, you essentially only really learn by doing,” he said. “And believe me, nothing teaches a student faster than getting thrown into the metaphorical deep end during live situations.”\n\nAlthough there is a huge demand for cybersecurity professionals (3.5 million job vacancies worldwide, in fact), Mac Namee points out that employers are emphatically looking for students who have also earned their stripes in the real world.\n\n“On its own, a four-year Cybersecurity degree doesn’t necessarily make you workforce-ready,” he said. “You also need the kind of real live experiences that you’ll only get from internships, work placements or opportunities such as the PISCES program.”","ogImage":{"url":""},"coverImage":""}},"__N_SSG":true}