{"pageProps":{"allPosts":[{"title":"Dr. Tsikerdekis selected as a U.S. Fulbright Scholar","date":"March 6, 2024","slug":"2024-03-06","author":{"name":null},"coverImage":"","excerpt":"Associate Professor Michael Tsikerdekis will spend 6 months in Greece in 2025 to research implementing a version of PISCES"},{"title":"On The Cyber Front Line In Big Sky Country","date":"February 21, 2024","slug":"2024-02-21","author":{"name":null},"coverImage":"/assets/posts/umt-soc-1.jpg","excerpt":"University of Montana Students Discover Threat Inside Critical Infrastructure During Cybersecurity Training Program"},{"title":"Small town in West Virginia suffers cyberattack","date":"January 8, 2024","slug":"2024-01-08","author":{"name":null},"coverImage":"","excerpt":"A cyberattack on the municipality of Beckley, West Virginia, caused a security breach within the city’s computer network on Thursday."},{"title":"New Veeam vulnerability advisory notice","date":"November 10, 2023","slug":"2023-11-10","author":{"name":null},"coverImage":"","excerpt":"This advisory is for organizations that use Veeam ONE to monitor virtual infrastructure, backup infrastructure, and data protection environments.  If your organization does not use this platform, this notification may be discarded. "},{"title":"Cyber students help protect civic institutions vulnerable to hackers","date":"September 12, 2023","slug":"2023-09-12","author":{"name":null},"coverImage":"","excerpt":"MSU Denver’s PISCES program provides cybersecurity monitoring for organizations throughout Colorado and gives students real-world experience in the process."},{"title":"CyberSensei Podcast hosts PISCES' Mike Hamilton","date":"March 29, 2023","slug":"2023-03-29","author":{"name":null},"coverImage":"","excerpt":"Mike Hamilton comes onto the CyberSensei podcast to discuss how to best prepare cybersecurity students for their jobs."},{"title":"FY23 PISCES Survey Results","date":"March 28, 2023","slug":"2023-03-28","author":{"name":null},"coverImage":"","excerpt":"In FY23 PISCES conducted a survey of all data sharing partners to better understand the community, students and assist in the planning process for the next cohort."},{"title":"Call for Papers for the 5th Annual PISCES Academic Workshop","date":"March 27, 2023","slug":"2023-03-27","author":{"name":null},"coverImage":"","excerpt":"The 5th Annual PISCES Academic Workshop will be held on 2 November 2023 in conjunction with the 27th CISSE at Kennesaw State University, Kennesaw, Georgia and on-line."},{"title":"Microsoft Urgent Outlook Vulnerability Notice","date":"March 17, 2023","slug":"2023-03-17","author":{"name":null},"coverImage":"","excerpt":"Microsoft has just released a patch to address a critical vulnerability in Microsoft Outlook for Windows"},{"title":"PISCES Partner Guides Students With Autism to Cybersecurity Careers","date":"February 16, 2023","slug":"2023-02-16","author":{"name":null},"coverImage":"","excerpt":"MSU Denver is working with neurodiverse cybersecurity students as part of PISCES."},{"title":"Training the Next Generation of Cyber Guardians","date":"November 2, 2022","slug":"2022-11-02","author":{"name":null},"coverImage":"","excerpt":"Executive director Steve Stein gives an overview of the program and some real cyber scenarios students have helped prevent."},{"title":"Eight Days Left to Apply for 2022 CyberForce Competition","date":"September 22, 2022","slug":"2022-09-22","author":{"name":null},"coverImage":"","excerpt":"The annual CyberForce Competition will be held as a hybrid competition this year on November 4-5, 2022. Registration is now open for the 2022 CyberForce Competition® for both student teams and volunteers. "},{"title":"An Intro To PISCES with Michael Hamilton and Steve Stein","date":"May 26, 2022","slug":"2022-05-26","author":{"name":null},"coverImage":"","excerpt":"Michael Hamilton and Steve Stein discuss the PISCES process and program operations."},{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"May 26, 2022","slug":"2022-06-07","author":{"name":null},"coverImage":"","excerpt":"Grace Dille of MeriTalk discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"2022-03-01","author":{"name":null},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"2022-01-19","author":{"name":null},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"2021-12-09","author":{"name":null},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"2021-12-02","author":{"name":null},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."},{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"2021-11-18","author":{"name":null},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"2021-11-13","author":{"name":null},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."}],"post":{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"May 26, 2022","slug":"2022-06-07","author":{"name":null},"content":"\n[MeriTalk's](https://www.meritalk.com/articles/cybercriminals-targeting-resource-poor-slgs-experts-say/) Grace Dille discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies.","ogImage":{"url":""},"coverImage":"","video":""}},"__N_SSG":true}