{"pageProps":{"allPosts":[{"title":"Why States Will Need to Step Up Cyber Help for Healthcare","date":"March 19, 2025","slug":"2025-03-19","author":{"name":"Marianne Kolbasuk McGee"},"coverImage":"","excerpt":"With respect to the federal government, it is increasingly looking like we're on our own,\" Hamilton said in an interview with Information Security Media Group. \"We are going to have to fill the gaps that are left by CISA."},{"title":"Why cybersecurity specialists should focus on minimizing damage caused by hackers rather than stopping all of their attacks","date":"March 15, 2025","slug":"2025-03-15","author":{"name":"Christian Vasquez"},"coverImage":"","excerpt":"The industry is undergoing a much needed switch from focusing on trying to prevent all unauthorized access to company networks to minimizing impact when a breach does occur. Because some breaches, at least, are nearly impossible to stop."},{"title":"The Cyber Security Recruiter talks to Michael Hamilton, Founder and CISO, Critical Insight","date":"January 13, 2025","slug":"2025-1-13","author":{"name":"Christian Vasquez"},"coverImage":"","excerpt":"Michael Hamilton talks with Thomas Richard on The Cyber Security Recruiter Podcast"},{"title":"NICE Challenge Project (to be XP Cyber in 2025)","date":"November 12, 2024","slug":"2024-11-12","author":{"name":null},"coverImage":"","excerpt":"Our cybersecurity challenges are designed around and inspired by the most in-demand technical cyber work roles and the tasks those work roles must be able to competently perform to be successful."},{"title":"Try Cyber","date":"November 11, 2024","slug":"2024-11-11","author":{"name":null},"coverImage":"","excerpt":"Try Cyber is a web application for cyber work role discovery and exploration."},{"title":"PISCES Technical Advisory Chair publishes new analyst book","date":"October 15, 2024","slug":"2024-10-15","author":{"name":null},"coverImage":"","excerpt":"The architect of the PISCES cyber analyst curriculum Michael Tsikerdekis has published a new book on taking you from zero to hero to ultimately become a security analyst."},{"title":"Spokane Falls Cyber Center trains future workforce through industry partnership","date":"July 23, 2024","slug":"2024-07-23","author":{"name":"Kayla Friedrich"},"coverImage":"","excerpt":"Through a partnership between the cyber program and PISCES, students are gaining real work experience as cyber analysts."},{"title":"PISCES International partners with Intersect Insight LLC to support its international expansion","date":"April 22, 2024","slug":"2024-04-22","author":{"name":null},"coverImage":"/assets/posts/intersect-insight.png","excerpt":"Intersect Insight LLC, an international business development and enterprise viability consultancy, has partnered with PISCES International to expand its global presence."},{"title":"Dr. Tsikerdekis selected as a U.S. Fulbright Scholar","date":"March 6, 2024","slug":"2024-03-06","author":{"name":null},"coverImage":"","excerpt":"Associate Professor Michael Tsikerdekis will spend 6 months in Greece in 2025 to research implementing a version of PISCES"},{"title":"On The Cyber Front Line In Big Sky Country","date":"February 21, 2024","slug":"2024-02-21","author":{"name":null},"coverImage":"/assets/posts/umt-soc-1.jpg","excerpt":"University of Montana Students Discover Threat Inside Critical Infrastructure During Cybersecurity Training Program"},{"title":"Small town in West Virginia suffers cyberattack","date":"January 8, 2024","slug":"2024-01-08","author":{"name":null},"coverImage":"","excerpt":"A cyberattack on the municipality of Beckley, West Virginia, caused a security breach within the city’s computer network on Thursday."},{"title":"New Veeam vulnerability advisory notice","date":"November 10, 2023","slug":"2023-11-10","author":{"name":null},"coverImage":"","excerpt":"This advisory is for organizations that use Veeam ONE to monitor virtual infrastructure, backup infrastructure, and data protection environments.  If your organization does not use this platform, this notification may be discarded. "},{"title":"Cyber students help protect civic institutions vulnerable to hackers","date":"September 12, 2023","slug":"2023-09-12","author":{"name":null},"coverImage":"","excerpt":"MSU Denver’s PISCES program provides cybersecurity monitoring for organizations throughout Colorado and gives students real-world experience in the process."},{"title":"CyberSensei Podcast hosts PISCES' Mike Hamilton","date":"March 29, 2023","slug":"2023-03-29","author":{"name":null},"coverImage":"","excerpt":"Mike Hamilton comes onto the CyberSensei podcast to discuss how to best prepare cybersecurity students for their jobs."},{"title":"FY23 PISCES Survey Results","date":"March 28, 2023","slug":"2023-03-28","author":{"name":null},"coverImage":"","excerpt":"In FY23 PISCES conducted a survey of all data sharing partners to better understand the community, students and assist in the planning process for the next cohort."},{"title":"Call for Papers for the 5th Annual PISCES Academic Workshop","date":"March 27, 2023","slug":"2023-03-27","author":{"name":null},"coverImage":"","excerpt":"The 5th Annual PISCES Academic Workshop will be held on 2 November 2023 in conjunction with the 27th CISSE at Kennesaw State University, Kennesaw, Georgia and on-line."},{"title":"Microsoft Urgent Outlook Vulnerability Notice","date":"March 17, 2023","slug":"2023-03-17","author":{"name":null},"coverImage":"","excerpt":"Microsoft has just released a patch to address a critical vulnerability in Microsoft Outlook for Windows"},{"title":"PISCES Partner Guides Students With Autism to Cybersecurity Careers","date":"February 16, 2023","slug":"2023-02-16","author":{"name":null},"coverImage":"","excerpt":"MSU Denver is working with neurodiverse cybersecurity students as part of PISCES."},{"title":"Training the Next Generation of Cyber Guardians","date":"November 2, 2022","slug":"2022-11-02","author":{"name":null},"coverImage":"","excerpt":"Executive director Steve Stein gives an overview of the program and some real cyber scenarios students have helped prevent."},{"title":"Eight Days Left to Apply for 2022 CyberForce Competition","date":"September 22, 2022","slug":"2022-09-22","author":{"name":null},"coverImage":"","excerpt":"The annual CyberForce Competition will be held as a hybrid competition this year on November 4-5, 2022. Registration is now open for the 2022 CyberForce Competition® for both student teams and volunteers. "},{"title":"An Intro To PISCES with Michael Hamilton and Steve Stein","date":"May 26, 2022","slug":"2022-05-26","author":{"name":null},"coverImage":"","excerpt":"Michael Hamilton and Steve Stein discuss the PISCES process and program operations."},{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"May 26, 2022","slug":"2022-06-07","author":{"name":null},"coverImage":"","excerpt":"Grace Dille of MeriTalk discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"2022-03-01","author":{"name":null},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"2022-01-19","author":{"name":null},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"2021-12-09","author":{"name":null},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"2021-12-02","author":{"name":null},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."},{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"2021-11-18","author":{"name":null},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"2021-11-13","author":{"name":null},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."}],"post":{"title":"Why cybersecurity specialists should focus on minimizing damage caused by hackers rather than stopping all of their attacks","date":"March 15, 2025","slug":"2025-03-15","author":{"name":"Christian Vasquez"},"content":"\n***(This article was originally published on [Fortune](https://fortune.com/2025/03/13/mike-hamilton-ciso-seattle-lumifi-cybersecurity/))***\n\n![Man in a mask using a laptop for hacking.](https://fortune.com/img-assets/wp-content/uploads/2025/03/GettyImages-1196235458-e1741812090914.jpg?w=800&q=75 \"Man in a mask using a laptop for hacking.\")\n\nMike Hamilton understands that being a CISO, or chief information security officer, is a Sisyphean task.\n\nFor more than 30 years, the former CISO of Seattle and current field CISO at Lumifi Cybersecurity, a company that manages cybersecurity for organizations, has helped small non-profits to the world’s largest companies defend against malicious hackers.\n\nHamilton spent years as a cybersecurity consultant for VeriSign Global Security, where he worked with Fortune 500 companies. His life, like that of many consultants, consisted of commuting through airports, hotels, rental cars, and restaurants. Then, his daughter was born and “dad’s not going to work on an airplane anymore,” he said. So, in 2006 Hamilton  took a pay cut and became involved in protecting critical infrastructure as Seattle’s CISO.\n\n“When I got there, everything changed,” Hamilton said. “I’m now working for an organization that keeps people alive. You knock over a waste treatment plant and, three days later, you have a public health emergency.”\n\nBefore getting into security consulting, Hamilton worked at some of the first companies that sold remote network security monitoring. With that background, his realization that few in state and local government kept a close eye on their networks set off an alarm.  \n\n## **Giving students experience**\n\nHelped by a mentor who knew federal government grants well, Hamilton was able to start a project that provided free network monitoring to state, local, tribal, and territorial governments.\n\nThe program, the [Public Infrastructure Security Cyber Education System](https://pisces-intl.org/about/pisces), uses trained students to monitor the networks of smaller communities that otherwise couldn’t afford to protect their technology, and report vulnerabilities or attacks on them. The program, known as PISCES, focused on critical infrastructure, or systems that keep the power, water, and other vital services operating. \n\nThe students in the program get much-needed operational experience that is often missing in the typical cybersecurity curriculum. [PISCES](https://pisces-intl.org/about/pisces) was a big success and continues to train the next generation of cybersecurity workers at 20 states colleges and universities.\n\nHamilton is set on getting the next generation up to speed because they need to be ready for the increasing tempo of operational impacts from attacks. After a long career in cybersecurity, he also believes that a college education simply isn’t enough.\n\nAfter Seattle, Hamilton continued his focus on the protection of vital systems and co-founded the cybersecurity firm Critical Insight in 2015. The company manages cybersecurity services like network monitoring and response if an incident occurs, complying with the litany of federal and state regulations, and testing networks for vulnerabilities. Hamilton spent nearly a decade as the CISO of Critical Insight before it was acquired last year by Lumifi Cybersecurity for an undisclosed amount.\n\nLumifi Cybersecurity serves some of the most vulnerable industries like water and wastewater, counties and small governments, education facilities, manufacturing, and rural hospitals.\n\nAlthough Hamilton may have changed the direction of his career, his time as Seattle’s CISO is “not a job I ever want again.” It’s not just because of the burnout, which is already an expected part of the job, or the [psychological trauma](https://www.csoonline.com/article/3829440/managing-the-emotional-toll-cybersecurity-incidents-can-take-on-a-team.html), or the [fear of getting sued](https://fortune.com/2025/03/04/ciso-cybersecurity-legal-liability-vulnerabilities/). CISO’s are fighting battles without a way to end the war.\n\n## **“You’re not going to ‘win’ this thing. All you can do is minimize impact,” Hamilton said.** \n\nThe industry is undergoing a much needed switch—one not nearly fast enough Hamilton argues—from focusing on trying to prevent all unauthorized access to company networks to minimizing impact when a breach does occur. Because some breaches, at least, are nearly impossible to stop. \n\nUltimately, the dizzying number of cybersecurity products are failing to stop a growing number of successful cyberattacks hitting organizations each year. The lack of success can be seen from major events. Just last year, there was the [Change Healthcare](https://fortune.com/company/change-healthcare/) breach that resulted in 190 million Americans sensitive health care data while ransomware attacks are [frequently evading detection tools](https://fortune.com/2025/02/28/hackers-malware-social-engineering/). \n\nReducing impact requires more than prevention, Hamilton said. Cybersecurity defenders should instead think of solutions rather than just Band-Aids. Removing network access completely where it is not needed instead of bolting on a cybersecurity product and hoping it will detect malicious code is one example of re-thinking policies around cybersecurity, Hamilton said.\n\nResearch firm Cybersecurity Ventures predicts cybercrime will [cost more than $10 trillion in 2025](https://cybersecurityventures.com/cybercrime-damage-costs-10-trillion-by-2025/). The estimate includes stolen money, extortions like ransomware attacks, intellectual property theft, fraud, recovery efforts, but  not the cost of defense. New hacker organizations are operating less like small-time criminals and more like small empires with huge revenue streams that rival the economies of small countries.\n\n“That’s the GDP of a country,” Hamilton said. “That’s who you are up against.”\n","ogImage":{"url":""},"coverImage":""}},"__N_SSG":true}