{"pageProps":{"allPosts":[{"title":"CyberSensei Podcast hosts PISCES' Mike Hamilton","date":"March 29, 2023","slug":"3-29-2023","author":{"name":null},"coverImage":"","excerpt":"Mike Hamilton comes onto the CyberSensei podcast to discuss how to best prepare cybersecurity students for their jobs."},{"title":"FY23 PISCES Survey Results","date":"March 28, 2023","slug":"3-28-2023","author":{"name":null},"coverImage":"","excerpt":"In FY23 PISCES conducted a survey of all data sharing partners to better understand the community, students and assist in the planning process for the next cohort."},{"title":"Call for Papers for the 5th Annual PISCES Academic Workshop","date":"March 27, 2023","slug":"3-27-2023","author":{"name":null},"coverImage":"","excerpt":"The 5th Annual PISCES Academic Workshop will be held on 2 November 2023 in conjunction with the 27th CISSE at Kennesaw State University, Kennesaw, Georgia and on-line."},{"title":"Microsoft Urgent Outlook Vulnerability Notice","date":"March 17, 2023","slug":"3-17-2023","author":{"name":null},"coverImage":"","excerpt":"Microsoft has just released a patch to address a critical vulnerability in Microsoft Outlook for Windows"},{"title":"PISCES Partner Guides Students With Autism to Cybersecurity Careers","date":"February 16, 2023","slug":"2-16-2023","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"MSU Denver is working with neurodiverse cybersecurity students as part of PISCES."},{"title":"Training the Next Generation of Cyber Guardians","date":"November 2, 2022","slug":"11-2-2022","author":{"name":"Steve Stein"},"coverImage":"","excerpt":"Executive director Steve Stein gives an overview of the program and some real cyber scenarios students have helped prevent."},{"title":"Eight Days Left to Apply for 2022 CyberForce Competition","date":"September 22, 2022","slug":"9-22-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"The annual CyberForce Competition will be held as a hybrid competition this year on November 4-5, 2022. Registration is now open for the 2022 CyberForce Competition® for both student teams and volunteers. "},{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"6-7-2022","slug":"6-7-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Grace Dille of MeriTalk discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies."},{"title":"An Intro To PISCES with Michael Hamilton and Steve Stein","date":"May 26, 2022","slug":"5-26-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Michael Hamilton and Steve Stein discuss the PISCES process and program operations."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"3-1-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"1-19-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"12-9-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"12-2-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."},{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"11-18-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"11-13-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."}],"post":{"title":"Microsoft Urgent Outlook Vulnerability Notice","date":"March 17, 2023","slug":"3-17-2023","author":{"name":null},"content":"\nOn 3/14/23 Microsoft released patches to address a critical vulnerability found in Microsoft Outlook for Windows. __This vulnerability affects only Microsoft Outlook for Windows__.  Other versions such as those for Android, iOS, Mac, and Outlook/M365 on the web are not affected.\n \n**CVE-2023-23397**\n\n**Microsoft Outlook Elevation of Privilege (EoP) Vulnerability**\n\n**CVSSv3.1:** 9.8\n\n\nThis vulnerability may be triggered by an attacker that sends a crafted, expired appointment to a user.  This will activate the reminder feature within Outlook for overdue appointments with no user interaction required.\n \nThe attacker-crafted appointment will exploit the path to the sound file that Outlook plays for a reminder when it is overdue, substituting a UNC (Universal Naming Convention) path within the message that leads to their own server.  This will cause the Outlook client to send the user’s login name and their NTLM password hash to the attacker’s remote server.\n \nThis exploit does ***NOT*** require the recipient to interact with the appointment received from the attacker.  The message will be processed behind the scenes, potentially leaving the user unaware that they have been compromised.\n \n**Mitigations**\n\n- Ensure current patches are applied.          \n- For those that cannot patch right away, Microsoft provides guidance for DCs using Windows 2012 R2 or newer.  Consider adding on-premises accounts to a Protected Users Security Group.  This prevents the use of NTLM as an authentication method by group members and continues to allow legacy applications that require NTLM to be excluded from the group and still utilize that authentication method. \n(Ensure that you review Microsoft documentation for Protected Users Security Groups before implementing:\n[https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/protected-users-security-group?WT.mc_id=M365-MVP-9501](https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/protected-users-security-group?WT.mc_id=M365-MVP-9501) )\n \n**Detection and Response**\n\n- Microsoft has made a script available that will review the Exchange environment to see whether a property is populated for a UNC path.  The script can also be used to clean up the property for the malicious appointment reminders or even delete the items permanently.\n- [https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/](https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/)\n \n**Additional Resources**\n\n- [https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/](https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/)\n- [https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397)\n","ogImage":{"url":""},"coverImage":""}},"__N_SSG":true}