{"pageProps":{"allPosts":[{"title":"PISCES Partner Guides Students With Autism to Cybersecurity Careers","date":"February 16, 2023","slug":"2-16-2023","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"MSU Denver is working with neurodiverse cybersecurity students as part of PISCES."},{"title":"Training the Next Generation of Cyber Guardians","date":"November 2, 2022","slug":"11-2-2022","author":{"name":"Steve Stein"},"coverImage":"","excerpt":"Executive director Steve Stein gives an overview of the program and some real cyber scenarios students have helped prevent."},{"title":"Eight Days Left to Apply for 2022 CyberForce Competition","date":"September 22, 2022","slug":"9-22-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"The annual CyberForce Competition will be held as a hybrid competition this year on November 4-5, 2022. Registration is now open for the 2022 CyberForce Competition® for both student teams and volunteers. "},{"title":"Cybercriminals Targeting Resource-Poor Local Governments","date":"6-7-2022","slug":"6-7-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Grace Dille of MeriTalk discusses how smaller state and local governments (SLGs) often do not have the resources to build a robust IT department, and how cybercriminals often target these smaller agencies."},{"title":"An Intro To PISCES with Michael Hamilton and Steve Stein","date":"May 26, 2022","slug":"5-26-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Michael Hamilton and Steve Stein discuss the PISCES process and program operations."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"3-1-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"1-19-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"12-9-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"12-2-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."},{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"11-18-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"11-13-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."}],"post":{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"3-1-2022","author":{"name":"Christian Perry"},"content":"\n[RANE Insights Podcast](https://worldview.stratfor.com/article/rane-insights-no-1-problem-cybersecurity) – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits.","ogImage":{"url":""},"coverImage":""}},"__N_SSG":true}