{"pageProps":{"allPosts":[{"title":"Biden’s Infrastructure Bill: What Does It Mean for Cybersecurity?","date":"November 18, 2021","slug":"11-18-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"President Joe Biden signed a $1 trillion bipartisan infrastructure spending bill into law on Nov. 15. PISCES’ Mike Hamilton discusses the new bill and its impacts on the cybersecurity talent gap, state and local governments, and the nation’s infrastructure."},{"title":"The Big Quit: Why Cybersecurity Pros Are Leaving Government","date":"November 13, 2021","slug":"11-13-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"Public-sector cybersecurity workers are frustrated by the lack of government investment and the bureaucratic slowness to innovate. Mike Hamilton discusses pay and the widening talent gap in cybersecurity."},{"title":"The No. 1 Problem in Cybersecurity","date":"March 1, 2022","slug":"3-1-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"RANE Insights Podcast – In this episode of the RANE Insights podcast, Greg Radner speaks with Michael Hamilton at Critical Insight Security about the challenges of defending against ever-increasing cybersecurity threats amid a revolution in work habits."},{"title":"How ‘The Great Resignation’ Is Affecting Cybersecurity","date":"January 19, 2022","slug":"1-19-2022","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES’ Mike Hamilton discusses the challenges of talent retention in cybersecurity."},{"title":"Biden administration wants 600,000 cybersecurity positions filled","date":"December 9, 2021","slug":"12-9-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"An onslaught of ransomware attacks has compelled the US government to push for a cybersecurity hiring spree. Various experts discuss the nation’s new cyber efforts and PISCES."},{"title":"PISCES and NCC","date":"December 2, 2021","slug":"12-2-2021","author":{"name":"Christian Perry"},"coverImage":"","excerpt":"PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center."}],"post":{"title":"PISCES and NCC","date":"December 2, 2021","slug":"12-2-2021","author":{"name":"Christian Perry"},"content":"\n[Video](https://youtu.be/XwzSgY2I9t0) - PISCES Director Steve Stein and Western Washington Professor Erik Fretheim, discuss the new partnership with Colorado’s National Cyber Center.","ogImage":{"url":""},"coverImage":""}},"__N_SSG":true}